**Pandas 13**

**#49 Seleksi Kolom dengan f-string**

**Import Modules**

In [1]:
import pandas as pd

print(pd.__version__)

1.3.4

**Persiapan Data Frame**

In [2]:
df = pd.read_csv('d:/data/Iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

**Seleksi Kolom dengan f-string**

In [3]:
df['SepalWidthCm'].to_frame().head() #toFrame digunakan untuk membuat kolom agar lebih tertata sedangkan head digunakan untuk menapilkan 5 data pertama

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [4]:
part = 'Sepal'

df[f'{part}WidthCm'].to_frame().head()

   SepalWidthCm
0           3.5
1           3.0
2           3.2
3           3.1
4           3.6

In [5]:
df[['PetalWidthCm', 'PetalLengthCm']].head()

   PetalWidthCm  PetalLengthCm
0           0.2            1.4
1           0.2            1.4
2           0.2            1.3
3           0.2            1.5
4           0.2            1.4

In [6]:
part = 'Petal'

df[[f'{part}WidthCm', f'{part}LengthCm']].head()

   PetalWidthCm  PetalLengthCm
0           0.2            1.4
1           0.2            1.4
2           0.2            1.3
3           0.2            1.5
4           0.2            1.4

**#50 Membuat Kolom Baru dengan for loop dan f-string**

**Import Modules**

In [7]:
import pandas as pd

print(pd.__version__)

1.3.4

**Persiapan Data Frame**

In [8]:
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'], 
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df = pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

**Membuat Kolom Baru dengan for loop dan f-string**

In [9]:
cols = ['penjual', 'barang'] #membuat dua kolom baru

for col in cols:
    df[f'count_tiap_{col}'] =  df.groupby(col).cumcount() + 1
    
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

**#51 Seleksi Baris dengan between**

**Import Modules**

In [10]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

**Persiapan Data Frame**

In [11]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  6  2  5  6
1  7  5  4  6  2
2  3  7  5  9  4
3  3  2  8  2  8
4  3  3  2  1  7
5  7  5  5  9  2
6  4  7  7  8  6
7  5  4  9  4  3
8  6  5  3  6  2
9  2  2  3  9  5

**Seleksi baris dengan between()**

In [12]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
2  3  7  5  9  4
3  3  2  8  2  8
4  3  3  2  1  7
6  4  7  7  8  6
7  5  4  9  4  3
9  2  2  3  9  5

In [13]:
df[df['A'].between(2, 5, inclusive=False)]

C:\Users\farre\AppData\Local\Temp/ipykernel_5932/2550752053.py:1: FutureWarning: Boolean inputs to the `inclusive` argument are deprecated infavour of `both` or `neither`.
  df[df['A'].between(2, 5, inclusive=False)]

   A  B  C  D  E
2  3  7  5  9  4
3  3  2  8  2  8
4  3  3  2  1  7
6  4  7  7  8  6

**#52 Transformasi Kolom menjadi Baris pada Data Frame**

**Import Modules**

In [14]:
import pandas as pd

print(pd.__version__)

1.3.4

**Persiapan Data Frame**

In [15]:
d = {
'kode_area': [123, 456, 789, 321],
'pabrik': [4, 2, 5, 0],
'gudang': [2, 4, 7, 3],
'toko': [64, 32, 15, 24]
}

df = pd.DataFrame(d)
df

   kode_area  pabrik  gudang  toko
0        123       4       2    64
1        456       2       4    32
2        789       5       7    15
3        321       0       3    24

**transformasi Kolom menjadi Baris**

df.melt() adalah fungsi yang digunakan untuk mentransformasikan kolom menjadi baris penggunaan method .melt() membutuhkan 3 parameter yang dimana parameter pertama adalah id_vars yang sering kali berasosiasi dengan primary key parameter kedua adalah var_name yang berasosiasi dengan nama kolom baru hasil transformasi kolom menjadi baris parameter ketiga adalah value name yang akan menampung jumlah dari hasil transformasi kolom menjadi baris

- Fungsi melt() digunakan untuk mentrasformasikan kolom menjadi sebuah baris.
- Fungsi ini membutuhkan minimal 3 buah parameter.
- Parameter pertama yaitu id_vars. Digunakan untuk menetukan kunci utama/ primary key.
- Parameter kedua yaitu var_name. Digunakan untuk menentukan nama kolom baru.
- Parameter ketiga yaitu value_name. Digunakan untuk menampung jumlah dari kolom.

In [16]:
df = df.melt(id_vars='kode_area', 
             var_name='jenis_bangunan', 
             value_name='jumlah')
df

    kode_area jenis_bangunan  jumlah
0         123         pabrik       4
1         456         pabrik       2
2         789         pabrik       5
3         321         pabrik       0
4         123         gudang       2
5         456         gudang       4
6         789         gudang       7
7         321         gudang       3
8         123           toko      64
9         456           toko      32
10        789           toko      15
11        321           toko      24